---
type: MultiReferenceAnnotationType
namespace: Autodesk.Revit.DB
version: 2024
members: 12
tags: [revit-api, class]
---

# MultiReferenceAnnotationType

`Autodesk.Revit.DB.MultiReferenceAnnotationType` · Revit 2024 · 12 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CreateDefault | 2014 | `public static MultiReferenceAnnotationType CreateDefault ( Document document )` |
| Method | GetAllowedTagCategory | 2014 | `public ElementId GetAllowedTagCategory ()` |
| Method | IsAllowedDimensionStyle | 2014 | `public bool IsAllowedDimensionStyle ( ElementId dimensionStyleId )` |
| Method | IsAllowedReferenceCategory | 2014 | `public bool IsAllowedReferenceCategory ( ElementId referenceCategoryId )` |
| Method | IsAllowedTagCategory | 2014 | `public static bool IsAllowedTagCategory ( ElementId tagCategoryId )` |
| Method | IsAllowedTagType | 2014 | `public bool IsAllowedTagType ( ElementId tagTypeId )` |
| Property | DimensionStyleId | 2014 | `public ElementId DimensionStyleId { get ; set ; }` |
| Property | GroupTagHeads | 2014 | `public bool GroupTagHeads { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | ReferenceCategoryId | 2014 | `public ElementId ReferenceCategoryId { get ; }` |
| Property | ShowDimensionText | 2014 | `public bool ShowDimensionText { get ; set ; }` |
| Property | TagTypeId | 2014 | `public ElementId TagTypeId { get ; set ; }` |